In [1]:
import pandas as pd

df = pd.read_csv('datasets/data_sf.csv')
small_df = df[df.columns[1:8]].head(25)
# display(small_df)

s = small_df.Nationality.value_counts()
display(
    s,
    s.index,
    s.Spain,
    s['Germany'],
    s.loc[s > 1]
)

Spain        4
Argentina    3
Belgium      3
Germany      3
Uruguay      3
France       2
Croatia      1
Portugal     1
Poland       1
Slovenia     1
England      1
Italy        1
Brazil       1
Name: Nationality, dtype: int64

Index(['Spain', 'Argentina', 'Belgium', 'Germany', 'Uruguay', 'France',
       'Croatia', 'Portugal', 'Poland', 'Slovenia', 'England', 'Italy',
       'Brazil'],
      dtype='object')

4

3

Spain        4
Argentina    3
Belgium      3
Germany      3
Uruguay      3
France       2
Name: Nationality, dtype: int64

In [70]:
import pandas as pd

df = pd.read_csv('./data_sf.csv')
small_df = df[df.columns[1:8]].head(25)
# display(small_df)


# Сколько футбольных клубов представлено в датасете?
len(df.Club.value_counts())


# Отметьте названия футбольных клубов, представленных в датасете наибольшим количеством игроков.
df.Club.value_counts()[:10]
                      
# Как называется футбольный клуб, представленный наименьшим количеством игроков в датасете 
# (скопируйте ответ из Jupyter Notebook)?
# df.Club.value_counts().tail(1).index[0]
# df.Club.value_counts(ascending=True).head(1).index[0]
# df.Club.value_counts(ascending=True).index[0]
# df.Club.value_counts().index[-1]
display(
    df.Club.value_counts().index[-1], 
    df.Club.value_counts().min()
)

'Atlético Mineiro'

6

In [83]:
import pandas as pd

df = pd.read_csv('./data_sf.csv')
small_df = df[df.columns[1:8]].head(25)

s = small_df['Nationality'].value_counts(normalize=True)
display(s)

Spain        0.16
Belgium      0.12
Germany      0.12
Argentina    0.12
Uruguay      0.12
France       0.08
Brazil       0.04
England      0.04
Slovenia     0.04
Poland       0.04
Italy        0.04
Portugal     0.04
Croatia      0.04
Name: Nationality, dtype: float64

In [89]:
import pandas as pd

df = pd.read_csv('./data_sf.csv')
small_df = df[df.columns[1:8]].head(25)


# Данные об игроках каких позиций (Position) занимают более 10% датасета?
s = df.Position.value_counts(normalize=True)
display(s[s > 0.1])


# Данные об игроках каких позиций (Position) занимают менее 1% датасета?
display(s[s < 0.01])

GK    0.127239
ST    0.117237
CB    0.108785
Name: Position, dtype: float64

LS     0.009382
RS     0.008839
RWB    0.005428
LWB    0.004652
CF     0.003954
LF     0.000620
LAM    0.000465
RF     0.000465
RAM    0.000388
Name: Position, dtype: float64

In [101]:
# s = small_df['Age'].value_counts()
# display(s)

# s = small_df['Wage'].value_counts()
# display(s)

s = small_df['Wage'].value_counts(bins=4)
display(s)
display(s.index[3])
small_df.loc[(small_df['Wage'] > s.index[3].left) & (small_df['Wage'] <= s.index[3].right)]

(211750.0, 329500.0]     9
(93528.999, 211750.0]    8
(329500.0, 447250.0]     6
(447250.0, 565000.0]     2
Name: Wage, dtype: int64

Interval(447250.0, 565000.0, closed='right')

        Name  Age Nationality          Club      Value    Wage Position
0   L. Messi   31   Argentina  FC Barcelona  110500000  565000       RF
7  L. Suárez   31     Uruguay  FC Barcelona   80000000  455000       RS

In [118]:
import pandas as pd

df = pd.read_csv('./data_sf.csv')
small_df = df[df.columns[1:8]].head(25)

# В каких пределах находятся худшие 20% показателей точности ударов ногой (FKAccuracy)?
s = df.FKAccuracy.value_counts(bins=5)
display(s.index.min())
display(s.loc[s == s.max()])

Interval(2.908, 21.2, closed='right')

(21.2, 39.4]    4859
Name: FKAccuracy, dtype: int64

In [128]:
s = small_df['Nationality'].value_counts()
print(s.index)
print(len(s.index))

display(small_df.Nationality.unique())
display(len(small_df.Nationality.unique()))
display(small_df.Nationality.nunique())

Index(['Spain', 'Belgium', 'Germany', 'Argentina', 'Uruguay', 'France',
       'Brazil', 'England', 'Slovenia', 'Poland', 'Italy', 'Portugal',
       'Croatia'],
      dtype='object')
13

array(['Argentina', 'Portugal', 'Brazil', 'Spain', 'Belgium', 'Croatia',
       'Uruguay', 'Slovenia', 'Poland', 'Germany', 'France', 'England',
       'Italy'], dtype=object)

13

13

12897

### Преобразование серии value_counts в датафрейм

In [135]:
s = small_df['Nationality'].value_counts()
s_df = s.reset_index()
s_df.columns = ['Nationality','Players Count']
display(s_df)

   Nationality  Players Count
0        Spain              4
1      Belgium              3
2      Germany              3
3    Argentina              3
4      Uruguay              3
5       France              2
6       Brazil              1
7      England              1
8     Slovenia              1
9       Poland              1
10       Italy              1
11    Portugal              1
12     Croatia              1

In [159]:
# У какого процента испанских специалистов (Nationality = 'Spain') зарплата (Wage) 
# находится в пределах 25% минимума от наблюдаемого уровня зарплат? 
# Ответ дайте в виде целого числа (округлите полученный результат) без знака %.
# Подсказка: Для решения задачи используйте value_counts() с параметром bins = 4.
s = df[df.Nationality == 'Spain'].Wage.value_counts(bins=4, normalize=True)
display(s[s.index.left == s.index.left.min()])
# display(s)

(620.999, 95750.0]    0.970194
Name: Wage, dtype: float64

In [164]:
# Укажите количество уникальных сборных (Nationality),
# к которым относятся футболисты, выступающие за клуб (Club) "Manchester United".
df[df.Club == 'Manchester United'].Nationality.nunique()

13

In [166]:
# С помощью функции unique определите двух футболистов из Бразилии (Nationality = 'Brazil'), 
# выступающих за клуб (Club) 'Juventus'. Перечислите их имена (Name, как в датафрейме) 
# через запятую в алфавитном порядке.
df[
    (df.Nationality == 'Brazil') & (df.Club == 'Juventus')
].Name.unique()

array(['Alex Sandro', 'Douglas Costa'], dtype=object)

In [170]:
# Укажите, какой из клубов (Club) насчитывает большее количество футболистов возрастом (Age) старше 35 лет.
df[df.Age > 35].Club.value_counts().index[0]

'Club Atlético Huracán'

In [187]:
# С помощью функции value_counts с параметром bins разбейте всех футболистов сборной (Nationality) Аргентины ('Argentina') 
# на 4 равные группы. Укажите, сколько футболистов в возрасте от 34.75 до 41 года в сборной Аргентины.
sdf = df[df.Nationality == 'Argentina'].Age.value_counts(bins=4)
display(sdf[sdf.index.left == 34.75])

(34.75, 41.0]    49
Name: Age, dtype: int64

In [195]:
# Сколько процентов футболистов из Испании (Nationality = 'Spain') имеют возраст (Age) 21 год? 
# Введите с точностью до 2 знаков после запятой без указания знака % (например, 12.35).
round(df[(df.Nationality == 'Spain')].Age.value_counts(normalize=True)[21], 4) * 100

11.77

In [217]:
grouped_df = df.groupby(['Club']).sum()

print(grouped_df.loc['Ajax'].Wage)

df.groupby(['Club']).Wage.sum().sort_values(ascending=False).head(5)

158000

Club
Real Madrid          4138000
FC Barcelona         3967000
Manchester City      3097000
Manchester United    2357000
Juventus             2335000
Name: Wage, dtype: int64

In [229]:
# Отметьте позиции (Position), по которым общая сумма зарплат (Wage) игроков превышает 5 млн евро в год.

df_sort = df.groupby(['Position']).Wage.sum().sort_values(ascending=False)
df_sort[df_sort > 5000000]

Position
ST     11873000
GK      8784000
CB      7476000
CM      6194000
LB      6096000
CAM     5500000
LM      5440000
RM      5098000
RB      5034000
Name: Wage, dtype: int64

In [234]:
# df.groupby(['Nationality'])[['Wage','Age','ShotPower']].mean()
display(
    df.groupby(
        ['Nationality']
    )[
        ['Wage','Age','ShotPower']
    ].mean().sort_values(
        ['Wage'],ascending=False
    ).head(10)
) 

df.loc[df.Nationality == 'Dominican Republic'][['Name','Club','Wage','Age','ShotPower']]

                            Wage        Age  ShotPower
Nationality
Dominican Republic  71000.000000  23.000000  75.500000
Egypt               35545.454545  25.818182  59.363636
Gabon               28900.000000  26.400000  56.900000
Croatia             26722.222222  24.819444  54.305556
Equatorial Guinea   25666.666667  28.000000  55.333333
Belgium             20024.390244  24.030488  56.390244
Ecuador             18333.333333  24.619048  60.666667
Uruguay             17590.361446  26.771084  56.192771
Brazil              17371.158392  27.898345  58.203310
Algeria             15810.810811  27.027027  56.567568

            Name         Club    Wage  Age  ShotPower
291      Mariano  Real Madrid  140000   24         85
6279  L. Quezada   Córdoba CF    2000   22         66

In [250]:
# Посчитайте среднюю зарплату (Wage) и цену (Value) игроков разных позиций (Position). 
# Представители какой позиции имеют самую высокую среднюю цену?
df.groupby(['Position'])[['Wage', 'Value']].mean().sort_values('Value', ascending=False)

                   Wage         Value
Position
LF         75125.000000  2.736250e+07
RF        119000.000000  2.636583e+07
LAM        61000.000000  1.324583e+07
RAM        11800.000000  8.345000e+06
LS         15421.487603  5.848430e+06
LCM        13497.854077  4.318090e+06
RCM        13504.166667  4.217604e+06
RS         13482.456140  3.645833e+06
LW         12169.421488  3.603099e+06
RW         13822.784810  3.495738e+06
LDM        10243.243243  3.369459e+06
RCB        11270.334928  3.009055e+06
CAM         8688.783570  2.963199e+06
RDM        11282.608696  2.692717e+06
LCB         9753.056235  2.636516e+06
LM          7472.527473  2.466174e+06
ST          7852.513228  2.157252e+06
RM          6655.352480  2.138734e+06
LWB         5783.333333  1.931333e+06
CF          4862.745098  1.848627e+06
CDM         7121.562952  1.658900e+06
CM          5805.060918  1.617465e+06
RWB         6000.000000  1.555571e+06
GK          5352.833638  1.502502e+06
LB          6083.832335  1.429032e+06
CB          5328.581611  1.321251e+06
RB          5310.126582  1.248940e+06

In [252]:
df.groupby(['Nationality'])[['Club','Name']].nunique()

             Club  Name
Nationality
Afghanistan     4     4
Albania        26    29
Algeria        33    37
Andorra         1     1
Angola          9    10
...           ...   ...
Uzbekistan      2     2
Venezuela      34    36
Wales          56   101
Zambia          5     6
Zimbabwe        8     9

[156 rows x 2 columns]

In [261]:
display(
    df.groupby(['Club']).Name.count(),
    '----------------------',
    df.groupby(['Club']).Name.value_counts(),
)

Club
 SSV Jahn Regensburg     24
1. FC Heidenheim 1846    20
1. FC Kaiserslautern     23
1. FC Köln               10
1. FC Magdeburg          21
                         ..
Zagłębie Sosnowiec       25
Çaykur Rizespor          22
Örebro SK                26
Östersunds FK            20
Śląsk Wrocław            24
Name: Name, Length: 650, dtype: int64

'----------------------'

Club                  Name
 SSV Jahn Regensburg  A. Dej             1
                      A. Fein            1
                      A. Geipl           1
                      A. Nandzik         1
                      A. Odabas          1
                                        ..
Śląsk Wrocław         P. Celeban         1
                      P. Kucharczyk      1
                      P. Samiec-Talar    1
                      R. Pich            1
                      W. Golla           1
Name: Name, Length: 12884, dtype: int64

In [265]:

df.groupby(['Club'])['Dribbling'].median() 
#      '---------------------------------------'
df.groupby(['Club']).Dribbling.mean()

Club
 SSV Jahn Regensburg     49.833333
1. FC Heidenheim 1846    52.000000
1. FC Kaiserslautern     49.173913
1. FC Köln               48.600000
1. FC Magdeburg          48.761905
                           ...
Zagłębie Sosnowiec       50.080000
Çaykur Rizespor          56.045455
Örebro SK                48.846154
Östersunds FK            53.300000
Śląsk Wrocław            51.583333
Name: Dribbling, Length: 650, dtype: float64

In [96]:
# Посчитайте среднюю (mean) и медианную (median) зарплату (Wage) футболистов 
# из разных клубов (Club). В скольких клубах средняя и медианная зарплаты совпадают?
# Подсказка: чтобы в процессе группировки применить к данным одновременно две агрегирующие функции, 
# необходимо указать их как аргументы метода agg:
#   df.groupby(столбец_для_группировки)[столбцы_для_отображения].agg(['функция_1', 'функция_2'])

import pandas as pd


df = pd.read_csv('./data_sf.csv')

# grouping Club column by  Wage with aggregating functions
gdf = df.groupby(['Club']).Wage.agg(['mean', 'median', 'count', 'min', 'max'])

# sorting by condition
sort_df = gdf[gdf['mean'] == gdf['median']]

# counting total records
display(len(sort_df))



# Продолжаем работать с клубами, в которых средняя зарплата совпадает с медианной. 
# Каков максимальный размер средней зарплаты в этой группе клубов?

display(
    sort_df['mean'].max(),
    sort_df.loc[sort_df['mean'] == sort_df['mean'].max()].index[0], 
)

52

13000.0

'Cruzeiro'

In [169]:
# С помощью функции groupby посчитайте сумму зарплат (Wage) 
# футболистов клуба (Club) "Chelsea".
import pandas as pd


df = pd.read_csv('./data_sf.csv')

df[df['Club'] == 'Chelsea']['Wage'].sum()


# Определите максимальную зарплату футболиста национальности 
# (Nationality) Аргентина ("Argentina") в возрасте 20 лет.
print('-' * 50)
# variant 1
max_wage = (df[
    (df['Nationality'] == "Argentina") & (df['Age']  == 20)
][['Wage', 'Name', 'Nationality', 'Age']].sort_values('Wage', ascending=False).head(1))
display(max_wage.iloc[0].Wage)

# variant 2 
max_wage = df[
    (df['Nationality'] == "Argentina") & (df['Age']  == 20)
].groupby(['Nationality'])[['Wage']].max()
display(max_wage.iloc[0].Wage)


# Определите максимальную зарплату футболиста национальности (Nationality) Аргентина ("Argentina") в возрасте 30 лет.
print('-' * 50)
max_wage_in_30 = (df[
    (df['Nationality'] == "Argentina") & (df['Age']  == 30)
]['Wage'].max())
display(max_wage_in_30)


# Определите минимальную зарплату футболиста национальности (Nationality) Аргентина ("Argentina") в возрасте 30 лет.
print('-' * 50)
max_wage_in_30 = (df[
    (df['Nationality'] == "Argentina") & (df['Age']  == 30)
]['Wage'].min())
display(max_wage_in_30)


# Определите максимальную силу (Strength) и баланс (Balance) среди игроков 
# клуба (Club) "FC Barcelona" из Аргентины ("Argentina"). 
# Ответ введите через точку с запятой без пробела.
print('-' * 50)
sdf = df[
    (df['Nationality'] == "Argentina") & (df['Club']  == 'FC Barcelona')
][['Strength', 'Balance']]
display(sdf)

--------------------------------------------------

54000

54000

--------------------------------------------------

300000

--------------------------------------------------

1000

--------------------------------------------------

   Strength  Balance
0        59       95

In [172]:
pivot = df.loc[
    df['Club'].isin(['FC Barcelona','Real Madrid','Juventus','Manchester United'])
  ].pivot_table(values=['Wage'],
                index=['Nationality'],
                columns=['Club'],
                aggfunc='sum')

display(pivot)


pivot = df.loc[df['Club'].isin(['FC Barcelona','Real Madrid','Juventus','Manchester United'])].pivot_table(values=['Wage'],
index=['Nationality'],
columns=['Club'],
aggfunc='sum',
margins=True)
display(pivot)

                           Wage
Club               FC Barcelona  Juventus Manchester United Real Madrid
Nationality
Argentina              565000.0  205000.0          206000.0         NaN
Belgium                110000.0       NaN          230000.0    240000.0
Bosnia Herzegovina          NaN  180000.0               NaN         NaN
Brazil                 465000.0  335000.0           91000.0    570000.0
Chile                  205000.0       NaN          215000.0         NaN
Costa Rica                  NaN       NaN               NaN    195000.0
Croatia                260000.0  160000.0               NaN    420000.0
Dominican Republic          NaN       NaN               NaN    140000.0
Ecuador                     NaN       NaN          120000.0         NaN
England                     NaN       NaN          478000.0         NaN
France                 495000.0  145000.0          375000.0    459000.0
Germany                240000.0  160000.0               NaN    355000.0
Italy                       NaN  460000.0           88000.0         NaN
Ivory Coast                 NaN       NaN          105000.0         NaN
Morocco                     NaN  160000.0               NaN         NaN
Netherlands            135000.0       NaN               NaN         NaN
Poland                      NaN  125000.0               NaN         NaN
Portugal               125000.0  405000.0               NaN         NaN
Scotland                    NaN       NaN           11000.0         NaN
Serbia                      NaN       NaN          165000.0         NaN
Spain                  912000.0       NaN          260000.0   1404000.0
Uruguay                455000.0       NaN               NaN         NaN
Wales                       NaN       NaN           13000.0    355000.0

                           Wage                                           \
Club               FC Barcelona   Juventus Manchester United Real Madrid
Nationality
Argentina              565000.0   205000.0          206000.0         NaN
Belgium                110000.0        NaN          230000.0    240000.0
Bosnia Herzegovina          NaN   180000.0               NaN         NaN
Brazil                 465000.0   335000.0           91000.0    570000.0
Chile                  205000.0        NaN          215000.0         NaN
Costa Rica                  NaN        NaN               NaN    195000.0
Croatia                260000.0   160000.0               NaN    420000.0
Dominican Republic          NaN        NaN               NaN    140000.0
Ecuador                     NaN        NaN          120000.0         NaN
England                     NaN        NaN          478000.0         NaN
France                 495000.0   145000.0          375000.0    459000.0
Germany                240000.0   160000.0               NaN    355000.0
Italy                       NaN   460000.0           88000.0         NaN
Ivory Coast                 NaN        NaN          105000.0         NaN
Morocco                     NaN   160000.0               NaN         NaN
Netherlands            135000.0        NaN               NaN         NaN
Poland                      NaN   125000.0               NaN         NaN
Portugal               125000.0   405000.0               NaN         NaN
Scotland                    NaN        NaN           11000.0         NaN
Serbia                      NaN        NaN          165000.0         NaN
Spain                  912000.0        NaN          260000.0   1404000.0
Uruguay                455000.0        NaN               NaN         NaN
Wales                       NaN        NaN           13000.0    355000.0
All                   3967000.0  2335000.0         2357000.0   4138000.0


Club                     All
Nationality
Argentina             976000
Belgium               580000
Bosnia Herzegovina    180000
Brazil               1461000
Chile                 420000
Costa Rica            195000
Croatia               840000
Dominican Republic    140000
Ecuador               120000
England               478000
France               1474000
Germany               755000
Italy                 548000
Ivory Coast           105000
Morocco               160000
Netherlands           135000
Poland                125000
Portugal              530000
Scotland               11000
Serbia                165000
Spain                2576000
Uruguay               455000
Wales                 368000
All                 12797000

In [193]:
# Сводная таблица, показывающая максимальные зарплаты игроков на разных позициях, играющих за разные клубы, 
# была создана с помощью кода: `df2 = df.pivot_table(columns = 'Position', index = 'Club', values = 'Wage', aggfunc = 'max')`
# С помощью какого кода можно получить из этой таблицы информацию о максимальной зарплате вратаря (GK), 
# играющего за футбольный клуб "Manchester City"?

df2 = df.pivot_table(
    columns = 'Position', 
    index = 'Club', 
    values = 'Wage', 
    aggfunc = 'max', 
    fill_value=0,
    margins=True
)

display(
    df2['GK']['Manchester City'], # my decision
    df2.loc['Manchester City']['GK']
)

125000

125000

In [209]:
pivot = df.loc[df['Club'].isin(['FC Barcelona','Real Madrid','Juventus','Manchester United'])].pivot_table(values=['Name'],
index=['Nationality'],
columns=['Club'],
aggfunc='count',
fill_value=0)
# display(pivot)

display(
    pivot.loc['Argentina']['Name']['Manchester United'],
    pivot['Name']['Manchester United']['Argentina']
)
pivot.sort_values(by = ('Name', 'FC Barcelona'), ascending = False)

2

2

                           Name
Club               FC Barcelona Juventus Manchester United Real Madrid
Nationality
Spain                         9        0                 1          11
France                        3        1                 2           3
Brazil                        2        2                 1           2
Argentina                     1        1                 2           0
Uruguay                       1        0                 0           0
Portugal                      1        1                 0           0
Netherlands                   1        0                 0           0
Belgium                       1        0                 1           1
Germany                       1        1                 0           1
Croatia                       1        1                 0           1
Chile                         1        0                 1           0
England                       0        0                 6           0
Ecuador                       0        0                 1           0
Dominican Republic            0        0                 0           1
Italy                         0        4                 1           0
Ivory Coast                   0        0                 1           0
Morocco                       0        1                 0           0
Poland                        0        1                 0           0
Costa Rica                    0        0                 0           1
Scotland                      0        0                 1           0
Serbia                        0        0                 1           0
Bosnia Herzegovina            0        1                 0           0
Wales                         0        0                 1           1

In [233]:
# Создайте сводную таблицу, содержащую сведения о количестве игроков, занимающих разные позиции 
# в каждом клубе. Отсутствующие значения замените нулями.

# Каково среднее количество вратарей (GK) в клубе? 
# Ответ округлите до трёх цифр после запятой.

import pandas as pd


df = pd.read_csv('./data_sf.csv')

pivot = df.pivot_table(
    values=['Name'],
    index=['Club'],
    columns=['Position'],
    aggfunc='count',
    fill_value=0
)

display(round(pivot.Name.GK.mean(), 3))


# Используя таблицу, созданную на предыдущем шаге, определите, 
# сколько клубов не содержат данных о центральных полузащитниках. (CM)

# Подсказка: для выполнения этого задания желательно сохранить сводную таблицу 
# в виде отдельного датафрейма и сгруппировать часть данных этого датафрейма с помощью value_counts().

display(
    len(pivot[pivot.Name.CM == 0].Name.CM), # my decision
    pivot.Name.CM.value_counts()[0] # what need in test task 
)

2.525

136

136

In [248]:
# С помощью сводной таблицы и функции loc посчитайте, сколько получают ("Wage") 
# русские футболисты ("Russia"), играющие за ФК "AS Monaco".
import pandas as pd


df = pd.read_csv('./data_sf.csv')

# my decision
russia_wage = df[
    (df.Nationality == 'Russia') & (df.Club == 'AS Monaco')
].Wage.sum() 
display(russia_wage)


# it required 
pivot = df.pivot_table(
    values = ['Wage'],
    index = ['Nationality'],
    columns = ['Club'],
    aggfunc='sum', 
    fill_value = 0
)
display(
    pivot.loc['Russia']['Wage']['AS Monaco'], 
    pivot.loc['Russia'].Wage['AS Monaco'], 
    pivot.Wage['AS Monaco'].Russia
)

61000

61000

61000

61000

In [418]:
# Создайте сводную таблицу, содержащую сведения о средней скорости футболистов, 
# занимающих разные позиции (Position) в разных футбольных клубах (Club).
# Основываясь на данных таблицы, отметьте три позиции, представители которых 
# в среднем обладают самой высокой скоростью.
import pandas as pd


df = pd.read_csv('./data_sf.csv')

pivot = df.pivot_table(
    values = ['SprintSpeed'],
    index = ['Position'],
    columns = ['Club'],
    aggfunc='mean', 
    fill_value = 0,
    margins=True
)

fp = pivot['SprintSpeed']['All'].reset_index().sort_values(by='All', ascending=False)
display(
    fp.loc[fp.Position.isin(['RB', 'LM', 'RM', 'CF', 'RWM', 'RS'])].head(3),
)

   Position        All
22       RM  74.943864
12       LM  74.211538
23       RS  71.991228

In [429]:
# Используя таблицу, созданную на предыдущем шаге, отметьте названия трёх клубов,
# в которых центральные форварды (ST) обладают наибольшей средней скоростью.
import pandas as pd


df = pd.read_csv('./data_sf.csv')

pivot = df.pivot_table(
    values = ['SprintSpeed'],
    index = ['Position'],
    columns = ['Club'],
    aggfunc='mean', 
    fill_value = 0,
    margins=True
)
display(pivot.loc['ST'].sort_values(ascending=False).head(3))

             Club
SprintSpeed  Vitória      91.0
             Sydney FC    88.0
             CD Lugo      87.0
Name: ST, dtype: float64